"""
Вхідні дані: 3 числа x, y та z. x, y -- невід'ємні цілі числа, z дорівнює 0 або 1. x не дорівнює 0. Передаються як аргументи командного рядка.

Вихідні дані: рядок "Everybody sing a song: <текст пісеньки>.", де <текст пісеньки> формується з у куплетів, розділених пробілами. Всі куплети однакові і складаються з x 'la' через дефіс. Якщо z дорівнює одиниці, в кінці ставиться окличний знак, інакше крапка. За відсутності куплетів пробіл перед крапкою/окличним знаком не ставиться.
"""

import sys

x = int(sys.argv[1])
y = int(sys.argv[2])
z = int(sys.argv[3])

str1 = 'la'
str2 = ' ' + str1 + ('-' + str1) * (x-1)
if z == 1:
    str3 = '!'
else:
    str3 = '.'
song = 'Everybody sing a song:' + str2 * y + str3

print song
