"""
Вхідні дані: рядок, що складається з відкриваючих та закриваючих круглих дужок - аргумент командного рядка. Для передачі в якості рядка послідовність береться в подвійні лапки.

Результат роботи: рядок "YES", якщо вхідний рядок містить правильну дужкову послідовність; або рядок "NO", якщо послідовність є неправильною. Дужкова послідовність вважається правильною, якщо всі дужки можна розбити попарно "відкриваюча"-"закриваюча", при чому в кожній парі закриваюча дужка слідує після відкриваючої.
"""


import sys
str = sys.argv[1]

count = 0

for char in str:
    if char == ')':
        count -= 1
    elif count < 0:
        break
    elif char == '(':
        count += 1
        
if count == 0:
    print "YES"
else: 
    print "NO"
