"""
Завдання передбачає пошук "щасливих" квитків. "Щасливим" називається такий тролейбусний квиток, в якому сума перших трьох цифр дорівнює сумі останніх трьох. Наприклад 030111 (0+3+0 = 1+1+1), 902326 (9+0+2 = 3+2+6), 001100 (0+0+1 = 1+0+0).

Вхідні дані: два цілих невід'ємних числа (0<=a1<=a2<=999999) - аргументи командного рядка.

Результат роботи: кількість "щасливих квитків", чиї номери лежать на проміжку від a1 до a2 включно. Якщо число на проміжку має менше 6 розрядів, вважати, що на його початку дописуються нулі у необхідній кількості, як це і відбувається при нумерації квитків. Виводити номери квитків не треба.
"""

import sys
a1 = int(sys.argv[1])
a2 = int(sys.argv[2])
count = 0

for num in range(a1, a2+1):
	num = list(str(num))
	num0 = [0 for i in range(6 - len(num))]
	num = num0 + num	
		
	if (int(num[0]) + int(num[1]) + int(num [2])) == (int(num[3]) + int(num[4]) + int(num[5])):
		count += 1

print count
